Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་སྨྲས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་ལ་དུ་དེ་བྱིན་ནོ། །
en: and the Blessed One handed the laḍḍū treat to him.

source: དེའི་ཚེ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་ཐག་མི་རིང་བ་ཞིག་ན་འདུག་པ། དེས་བསམས་པ།
en: At that time, not far from the Blessed One was sitting the householder Anāthapiṇḍada, who thought,

source: བཅོམ་ལྡན་འདས་ནི་བསོད་སྙོམས་གཞན་བཞེས་མི་སྲིད་དེ། དེ་ནི་གནས་མེད་ཅིང་སྐབས་མ་ཡིན་ནོ་
en: “It won’t be possible for the Blessed One to take alms again today. There’s nowhere else, no other opportunity.”

source: སྙམ་དུ་རིག་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་གུད་དུ་བཀར་ཏེ། བྲམ་ཟེའི་ཁྱེའུ་ལ་སྨྲས་པ།
en: Realizing that there was no other place and no other opportunity for the Blessed One to take alms, he pulled the brahmin child aside and said,

source: བྲམ་ཟེའི་ཁྱེའུ་ལ་དུ་འོ་ནི་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཕུལ་ཅིག་དང་། བདག་གིས་ཁྱོད་ལ་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་སྦྱིན་ནོ། །
en: “Little brahmin, give that laḍḍū treat back to the Blessed One and I’ll give you five hundred gold coins.”

source: བྲམ་ཟེའི་ཁྱེའུས་སྨྲས་པ།
en: the brahmin child said,

source: ཁྱིམ་བདག་ཁྱོད་ཅི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ་ཞེས་
en: “As you wish, householder,”

source: བྱས་ནས་ བྲམ་ཟེའི་ཁྱེའུ་དེས་ལ་དུ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྷུང་བཟེད་ཀྱི་ནང་དུ་བཅུག་གོ། །
en: and he put the laḍḍū treat back into the Blessed One’s alms bowl.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བསོད་སྙོམས་དེ་བཞེས་ནས་གཙུག་ལག་ཁང་དུ་གཤེགས་སོ། །
en: The Blessed One finished his alms round and returned to the monastery.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་དེ་ཁྱིམ་དུ་ཁྲིད་དེ། ཟན་བྱིན་ནས་ཀཱརྵཱ་པ་ཎ་ལྔ་བརྒྱ་བྱིན་ཏེ་བཏང་ངོ་། །
en: Meanwhile, the householder Anāthapiṇḍada brought the brahmin child home, gave him something to eat, and handed him the five hundred gold coins.

source: བཙུན་པ་ཀྱེ་མ་བྲམ་ཟེའི་ཁྱེའུ་འདིས་བཅོམ་ལྡན་འདས་ལས་ལ་དུ་བླངས་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་མ་སྩལ་ལ། གང་གི་ཚེ་དེས་ཀྱེ་གཽ་ཏ་མ་ལ་དུ་འདི་བདག་ལ་མི་དགོས་སོ་ཞེས་སྨྲས་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ལ་དུ་སྩལ་པ་ལ་གཟིགས།
en: “Lord, tell us why the Blessed One would not give the brahmin child the laḍḍū treat when he begged the Blessed One for it, but the Blessed One gave the laḍḍū treat to him after the child said, ‘Hey Gautama, I don’t need that laḍḍū treat,’ .”

source: བྲམ་ཟེའི་ཁྱེའུ་དེས་ནི་ཚེ་རབས་སྟོང་ཕྲག་དུ་མར་བླང་བའི་འདུ་ཤེས་འབའ་ཞིག་ཀུན་དུ་བསྟེན་ཅིང་བསྒོམས་ཏེ།
en: “for many thousands of lifetimes, that brahmin child frequently indulged, became addicted, and ended up wanting more.

source: མང་དུ་བྱས་ནས་འདི་རྟག་ཏུ་གཞན་འབའ་ཞིག་ལ་རེ་བར་གྱུར་པས་ན། ངས་འདི་ད་ལྟར་ལ་དུས་བྲིད་ནས་བླང་བའི་འདུ་ཤེས་ལས་བཟློག་སྟེ།
en: Thus I’ve lured him with a laḍḍū treat to turn him away from his preoccupation with acquiring things;

source: འདི་ཉིད་འདིའི་རབ་ཏུ་འབྱུང་བ་དང་། ཕུང་པོ་ཡོངས་སུ་སྤོང་བའི་རྒྱུར་འགྱུར་རོ། །
en: that will be the sole cause of his going forth and giving up his aggregates.”

source: བཙུན་པ་བྲམ་ཟེའི་ཁྱེའུ་འདིའི་ཕུང་པོ་གང་དུ་ཡོངས་སུ་སྤོང་བར་འགྱུར་ལགས།
en: “Lord, when will this brahmin child give up his aggregates?”

source: དགེ་སློང་དག་མ་འོངས་པའི་དུས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་བོ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ
en: “Monks, in the future a totally and completely awakened Buddha named Mountain , who will far surpass the listeners and solitary buddhas, will emerge in the world.

source: དེའི་གསུང་རབ་ལ་འདིས་མིར་སྐྱེ་བ་ཐོབ་ནས། རྒྱུ་འདི་ཁོ་ནས་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ།། །།
en: It is in his doctrine alone that, having obtained a human birth, he will go forth, cast away the afflictive emotions, and manifest arhatship.”

source: འདུས་མོ་ཞེས་བྱ་བ་ནི།
en: The Story of She Who Gathers

source: དེའི་ཚེ་ཡུལ་ཏཀྵ་ཤཱི་ལ་ན། རྒྱལ་པོ་པད་མའི་སྙིང་པོ་ཅན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: When the Blessed One was in Rājagṛha, there was a king named Padmagarbha who reigned in Takṣaśīla.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་དང་།
en: His kingdom was prosperous, flourishing, happy, and well populated. The harvest was good.

source: རྩོད་པ་དང་། འཐབ་པ་ཞི་བ་དང་། འཁྲུག་པ་དང་། ནང་འཁྲུག་དང་། ཆོམ་རྐུན་དང་། མུ་གེ་དང་། ནད་རྣམས་མེད་པ་དང་།
en: Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine.

source: འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་དང་། མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: Rice, sugarcane, cattle, and buffalo were plentiful.

source: དེ་ནས་དེ་བཙུན་མོ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། བཙུན་མོ་ལ་བུ་ཆགས་ནས། དེའི་ཡིད་ལ་
en: As he and the queen enjoyed themselves and coupled, the queen conceived, and her mind became filled with thoughts like,

source: གཞུང་སྨྲ་བ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྩོད་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་ཡིད་ལ་འདོད་པ། དེ་ལྟ་བུ་ཞིག་སྐྱེས་སོ། །
en: “If only I could debate the scriptural exegetes!” and other fervent wishes of that sort.

source: དེ་ནས་རྒྱལ་པོས་དེ་ཐོས་མ་ཐག་ཏུ་ལྟས་མཁན་རྣམས་ལ་བསྟན་ཏེ།
en: When the king heard of this, he took her to the soothsayers.

source: ལྟས་མཁན་རྣམས་ན་རེ་
en: the soothsayers said,

source: འདི་ནི་ལྟོ་ན་མཆིས་པའི་སེམས་ཅན་དེའི་མཐུ་ལགས་ཏེ། དེས་ནི་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་པར་འགྱུར་ལ་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་གཅོད་པར་འགྱུར་ཏེ། དེའི་སླད་དུ་འདིའི་ཡིད་ལ་འདོད་པ། དེ་ལྟ་བུ་སྐྱེས་པ་ལགས་སོ་ཞེས་ཟེར་རོ། །
en: “she has such fervent wishes in her mind because the being in her womb will understand all the treatises and defeat all scriptural exegetes.”

source: ཤེས་ལྡན་དག་གལ་ཏེ། བཙུན་མོའི་ཡིད་ལ་འདོད་པ་སྐྱེས་པ་དེ་མ་བསལ་ན།
en: “Wise ones, what will happen if we can’t get this wish out of her mind?”

source: དེ་ཅིར་འགྱུར་ལྟས་མཁན་རྣམས་ཀྱིས་སྨྲས་པ།
en: the soothsayers replied.

source: སྲས་དེ་ཡན་ལག་མ་ཚང་བར་སྐྱེ་བར་འགྱུར་ལགས་སོ། །
en: “The heir born to you will have missing limbs,”

source: བདག་གི་བུ་ཡིན་ལ་ཡན་ལག་མ་ཚང་བར་འགྱུར་ན་མི་རུང་ངོ་
en: “I can’t bear for my child to be born with missing limbs!”

source: སྙམ་ནས་བཙུན་མོ་ཡོལ་བའི་ནང་དུ་བཞག་སྟེགཞུང་སྨྲ་བ་ཐམས་ཅད་བསགས་ནས་གཟུ་བོ་རྣམས་ཀྱང་བསྐོས་ཏེ། གཞུང་གིས་རྩོད་དུ་བཅུག་གོ། །
en: So he sat the queen behind a curtain, assembled all the scriptural exegetes, and, after appointing impartial observers, had them debate the scriptures with her.

source: དེ་ནས་དེས་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་ནས། དེའི་ཡིད་ལ་འདོད་པ་སྐྱེས་པ་དེ་མེད་པར་གྱུར་ཏོ། །
en: Once she had defeated all of the scriptural exegetes, her fervent desire subsided.

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ།
en: At the elaborate feast celebrating her birth they asked,

source: བུ་མོ་འདིའི་མིང་ཅི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?”

source: བུ་མོ་འདིའི་མས་འདུས་པའི་ནང་དུ་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་པས་ན་བུ་མོ་འདིའི་མིང་འདུས་མོ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named her, saying, “Since her mother defeated all the other scriptural exegetes before a great gathering of people, the child’s name will be She Who Gathers.”

source: དེ་ནས་བུ་མོ་འདུས་མོ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་། དྲི་མ་འཁྲུ་བའི་མ་མ་གཉིས་དང་། རྩེ་བའི་མ་མ་གཉིས་ཏེ། མ་མ་བརྒྱད་ལ་གཏད་ནས།
en: Young She Who Gathers was raised by eight nurses—two nurses to hold her in their laps, two wet nurses, two nurses to bathe her, and two nurses to play with her.

source: དེ་སྲེད་མེད་ཀྱི་བུའི་ལག་ན་ཐོགས་པའི་རྨ་བྱའི་མདོངས་དང་བསྲུང་བའི་སྲད་བུ་དང་། འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They raised her with a protection cord, and the eye of a peacock feather from the hand of Nārāyaṇa. They reared her on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ། དེ་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་དུ་ཡོལ་བའི་ནང་དུ་བཞག་ནས་ཡི་གེ་བསླབས་སོ། །
en: As she grew up, she sat behind a curtain in the royal palace and studied letters on her own.

source: དེ་ཡི་གེ་བྱང་ནས་དེས་ཡོལ་བའི་ནང་འབའ་ཞིག་ཏུ་བསྟན་བཅོས་ཐམས་ཅད་བསླབས་ནས་ཡུལ་ཏཀྵ་ཤཱི་ལ་དེར་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་དོ། །
en: She perfected her reading skills, studied all the treatises on her own, and defeated all the scriptural exegetes in Takṣaśīla from behind the curtain.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོས་བུ་མོ་དེ་ལ་དྲིས་པ།
en: One day the king asked the young woman,

source: ཁྱོད་ངས་སུ་ལ་སྦྱིན་པར་བྱ།
en: “To whom should I give you in marriage?”

source: སུས་གཞུང་བརྩད་པས་བདག་ཐུབ་པར་ནུས་པ་དེ་ལ་སྩལ་བར་གསོལ།
en: “Award me to any with the skill to defeat me in scriptural debate,”

source: དེ་ནས་རྒྱལ་པོས་དེ་ཐོས་ནས་འདིས་འདི་ལྟ་བུའི་ཚིག་སྨྲས་པ་ལས་ན།
en: When the king heard this he thought,

source: བུ་མོ་འདི་ནི་ངས་གཞུང་སྨྲ་བ་གང་གིས་འདི་ཐུབ་པ་དེ་འབའ་ཞིག་ལ་སྦྱིན་པར་བྱའི་བྱད་གཟུགས་བཟང་བ་ལ་ཡང་མི་སྦྱིན། རིགས་མཐོ་བ་ལ་ཡང་མི་སྦྱིན། དབང་ཕྱུག་དང་ལྡན་པ་ལ་ཡང་མི་སྦྱིན་ནོ་ཞེས་ཟེར་རོ། །
en: “She has such an ability to speak. I must not give her to one who is merely good looking, or of high caste, or great influence, but to one who can defeat her in debate, and none other.”

source: དེ་ནས་དེའི་སྒྲ་དེ་ཀུན་ཏུ་གྲགས་ནས།
en: After that, word spread quickly.

source: དེ་ཐོས་མ་ཐག་ཏུ་ཕྱོགས་ཀུན་ནས་གཞུང་སྨྲ་བ་རྣམས་ལྷགས་པ་ལས་བུ་མོ་དེས་ཐམས་ཅད་ཚར་བཅད་དོ། །
en: As soon as they heard, all the scriptural exegetes from neighboring lands began to arrive, and the young woman defeated them all.

source: དེ་ནས་དེའི་ཚེ་ལྷོ་ཕྱོགས་ན་གཞུང་སྨྲ་བ་རིའུ་ཞེས་བྱ་བ་བསྟན་བཅོས་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པ་གཙུག་ལག་ཆེ་བ།
en: In the south there lived a scriptural exegete named Riu who feared no text.

source: གཙུག་ལག་ལ་འབྱམ་པ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ།
en: He was well educated and knowledgeable, well proportioned, pleasing to the eye, beautiful, and had an excellent complexion.

source: ཁ་དོག་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པ་ཞིག་གནས་པ་དེས་ཡུལ་ཏཀྵ་ཤཱི་ལའི་རྒྱལ་པོ་པད་མའི་སྙིང་པོའི་སྲས་མོས་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་ལ་དེའི་ཡབ་ཀྱིས་ཀྱང་དེ་ལྟ་བུར་དམ་བཅས་སོ་ཞེས་ཐོས་སོ། །
en: He heard that in Takṣaśīla, King Padmagarbha’s daughter had defeated all the scriptural exegetes, and he heard as well about the promise her father had made to them.

source: དེ་ཐོས་མ་ཐག་ཏུ་དེ་ཡ་མཚན་དུ་གྱུར་ཏེ།
en: Astounded to hear all this, he thought,

source: བདག་དེར་སོང་ལ་དེ་ཅི་ཤེས་པ་བལྟའོ་སྙམ་མོ། །
en: “Let me go there and see for myself.”

source: དེ་ནས་དེ་འཁོར་ལྔ་བརྒྱ་དང་ཆས་ཏེ། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ནགས་ཁྲོད་ཀྱི་གྲོང་དང་། ཡུལ་པོ་ཆེ་རྣམས་སུ་རྒྱུ་ཞིང་གཞུང་སྨྲ་བ་རྣམས་ཀྱང་ཚར་གཅོད་པར་བྱེད་པ་ལས་མཐར་གྱིས་ཡུལ་ཏཀྵ་ཤཱི་ལར་ཕྱིན་ནས་
en: So with a retinue of five hundred he made his way through the villages, towns, forest settlements, and cities small and large, defeating all the other scriptural exegetes as he went, until eventually he arrived in Takṣaśīla.

source: དེས་རྒྱལ་པོ་པད་མའི་སྙིང་པོ་ཅན་གྱི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: There he approached King Padmagarbha and said,

source: བདག་གིས་ཐོས་ན་ལྷའི་སྲས་མོས་གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་ཅེས་གདའ་ན
en: “I heard that you, Deva, have a daughter who has defeated all the scriptural exegetes.

source: བདག་གིས་ཀྱང་མཁན་པོ་ལས་བསྟན་བཅོས་བསླབས་པ་དག་མཆིས་པས་བདག་ཀྱང་དེ་དང་བཀའ་མཆིད་བགྱི་བར་འཚལ་ལོ། །
en: As I have studied treatises under great masters myself, I too would like to converse with her.”

source: ཁྱོད་ཇི་ལྟར་དགའ་བ་བཞིན་དུ་བྱའོ་ཞེས་སྨྲས་ནས།
en: “As you wish,”

source: རྒྱལ་པོ་དེས་གཞུང་སྨྲ་བའི་འཁོར་བསགས་ཏེ་སོ་སོའི་གཞུང་བཙུགས་ནས་བུ་མོ་དེ་ཡོལ་བའི་ནང་དུ་བཞག་སྟེ།
en: The king called together the scriptural exegetes, placed each of their philosophical texts before them, and the young woman took her place behind the curtain.

source: བུ་མོ་དེས་གཞུང་སྨྲ་བའི་རིའུ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ། མཛེས་པ་ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་པ་མཐོང་ནས་དེ་མཐོང་མ་ཐག་ཏུ་འདོད་ཆགས་ཀྱི་མདས་ཕོག་སྟེདེས་བསམས་པ།
en: But as soon as the young woman saw the scriptural exegete Riu—who was well proportioned, pleasing to the eye, beautiful, and excellently complected—an arrow of lust shot through her, and she thought,

source: བདག་གིས་ཁྱིམ་ཐབ་འདི་འདྲ་བ་ག་ལས་ཀྱང་མི་རྙེད་ཀྱིས་འདི་ཁོ་ན་བདག་གི་ཁྱིམ་ཐབ་ཏུ་བྱ་དགོས་ཀྱི་གཞན་ནི་མི་འདོད་དོ་སྙམ་དུ་བསམས་ནསདེས་ཅི་ནས་གཞུང་སྨྲ་བ་དེས་བདག་ཐུབ་པར་འགྱུར་བ་དེ་ལྟར་བྱས་སོ། །
en: “I won’t find a spouse like this anywhere. He alone should be my spouse. I want no one else,” and she allowed him to defeat her.

source: བདག་གིས་དམ་བཅས་པ་ལ་གཞུང་སྨྲ་བ་གང་གིས་འདི་ཐུབ་པར་འགྱུར་བ་དེ་ལ་བདག་གིས་འདི་སྦྱིན་པར་བྱའི། བདག་གིས་འདི་བྱད་གཟུགས་བཟང་བ་ལ་ཡང་མི་སྦྱིན། རིགས་མཐོ་བ་ལ་ཡང་མི་སྦྱིན་དབང་ཕྱུག་དང་ལྡན་པ་ལ་ཡང་མི་སྦྱིན་ནོ་ཞེས་དམ་བཅས་པ་ལས།
en: “I promised that I would give my daughter to a capable debater—not to one who is merely good looking, of high caste, or of great influence, but to one who can defeat her in debate, and none other.

source: འདིས་འདི་ཐུབ་པར་གྱུར་ལ་འདི་ཡང་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་ཏེབདག་གིས་འདི་ལས་ལྷག་པ་གུད་ནས་གཞུང་སྨྲ་བ་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་མི་རྙེད་ཀྱིས། མ་ལ་བདག་གིས་འདི་ཁོ་ན་ལ་སྦྱིན་པར་བྱའོ་
en: This man is not only capable in debate, but he is also well proportioned, pleasing to the eye, and beautiful. I shall not find one better than him, nor will I find a more excellent scriptural exegete. I will not give her to anyone but him!”

source: སྙམ་དུ་བསམས་ནས། ཁྱིམ་པ་རྣམས་ཀྱི་ཁྱིམ་པའི་ཆོས་གང་ཡིན་པ་དེ་བཞིན་དུ་བྱས་ཏེ། བུ་མོ་དེ་དེ་ལ་བྱིན་ནས་དབང་ཕྱུག་ཆེན་པོར་ཡང་བསྐོས་སོ། །
en: With this thought, he undertook all that custom required of him. The king gave the young woman to the man and appointed him to a great lordship.

source: དེ་ཡང་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: She Who Gathers and Riu enjoyed themselves and coupled.

source: དེ་ནས་ཕྱི་ཞིག་ན། བུ་མོ་དེ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: One day the young woman conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་
en: At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?”

source: ཁྱེའུ་འདི་རུས་ཀཱ་ཏྱཱ་ཡ་ན་ཡིན་ལ་འདུས་མོའི་བུ་ཡིན་པས་ན་འདུས་པའི་ཀཱ་ཏྱཱ་ཡ་ན་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since the name of his clan is Kātyāyana, and he is the child of She Who Gathers, his name will be Kātyāyana Who Gathers.”

source: དེ་ནས་ཁྱེའུ་འདུས་པའི་ཀཱ་ཏྱཱ་ཡ་ན་འོ་མ་དང་། ཞོ་དང་མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Kātyāyana on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་བྲམ་ཟེའི་སྤྱོད་ལམ་དང་སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་།
en: As he grew up he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction.

source: ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས་ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེདེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: Trained in these procedures, he became a master of the six types of brahminical activities, and in time he mastered the eighteen sciences.

source: དེས་ལོ་བཅུ་དྲུག་ལོན་ནས་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་ཏེ། གཞུང་སྨྲ་བ་ཐམས་ཅད་ཚར་བཅད་ནས་དེའི་བློ་འདི་ལྟ་བུ་ཞིག་སྐྱེས་ཏེ། འཛམ་བུའི་གླིང་ན་བདག་དང་མཉམ་པ་ཡང་མེད་ན་ལྷག་པ་ལྟ་ཅི་སྨོས་སྙམ་དུ་རློམ་པ་དེས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཁྱད་དུ་གསོད་པར་བྱེད་དོ། །
en: At age sixteen he understood all the treatises and defeated all the scriptural exegetes. He started to feel arrogant and thought that in all Jambudvīpa not even one person was his equal, much less his superior, and this made him despise everyone.

source: དེ་ནས་དགེ་བསྙེན་ཞིག་གིས་དེ་ལ་སྨྲས་པ།
en: One day a lay vow holder said to him,

source: ཁྱེའུ་ཁྱོད་བདག་དང་མཉམ་པ་སུ་ཡང་མེད་ན། ལྷག་པ་ལྟ་ཅི་སྨོས་སྙམ་དུ་རློམ་པ་འདིས་རྒྱགས་པར་མ་བྱེད་ཅིག །
en: “Child, don’t be haughty, arrogantly thinking that not even one person is your equal, much less your superior.

source: ཁྱེའུ་ཡུལ་དབུས་ན་ཤཱཀྱའི་བུ་ཞིག་སྐྱེས་པ་དེ་བྲམ་ཟེ་ལྟས་མཁན་བྱེ་བྲག་ཕྱེད་པ་རྣམས་ཀྱིས་ལུང་བསྟན་ཏེ་གལ་ཏེ་ཁྱིམ་ན་གནས་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: Child, there was a young Śākya born in Magadha, about whom the brahmin soothsayers and augurs made this prediction:

source: གལ་ཏེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་ཆོས་གོས་ཚོན་ཅན་བགོས་ནས་ཡང་དག་པའི་དད་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི། འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲ་ཆེར་གྲགས་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་ལས་དེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་
en: “ ‘If he remains here at home, he will become a universal monarch, but if he shaves his head and face and dons the colorful religious robes, and if he goes forth from home to live as a mendicant with nothing short of perfect faith, he will be renowned throughout the world as a tathāgata, an arhat, a totally and completely awakened buddha.’

source: ཆོས་གོས་ཚོན་ཅན་བགོས་ནས་ཡང་དག་པའི་དད་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེབླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ལ་ནི། ཁྱོད་ཀྱི་གཟུགས་དང་ཤེས་རབ་ཀྱིས་ཀྱང་བརྒྱའི་ཆར་ཡང་མི་ཕོད་སྟོང་གི་ཆར་ཡང་མི་ཕོད། འབུམ་གྱི་ཆར་ཡང་མི་ཕོད། ཁྲག་ཁྲིག་གི་ཆར་ཡང་མི་ཕོད་དེ། གྲངས་སུ་བགྲང་དུ་ཡང་མེད་དོ་ཞེས་བྱས་སོ། །
en: “Compared to the one who, as prophesied, shaved his head and face, donned the colorful religious robes, and with nothing short of perfect faith went forth from home to live as a mendicant—the Buddha, who has fully and completely awakened unto unexcelled, total, and complete enlightenment—your form and wisdom are not even a thousandth, not even a hundred thousandth, not even a millionth or a billionth, not even an incalculably small fraction of his.”

source: དེ་ནས་ཁྱེའུ་དེས་སངས་རྒྱས་ཞེས་བྱ་བའི་སྒྲ་སྔོན་མ་ཐོས་པ་ཐོས་ནས་སྤུ་ཐམས་ཅད་ཟིང་ཞེས་བྱས་ཏེ་ལྟ་འདོད་པར་གྱུར་ཏོ། །
en: When the young man heard the name Buddha, a sound unlike any he had heard before, it gave him goosebumps, and he was eager to see him.

source: དེ་ནས་དེས་ཕ་མ་ལ་གསོལ་ཏེ།
en: So he asked for his parents’ permission, saying,

source: ཡབ་ཡུམ་བདག་ཡུལ་དབུས་སུ་མཆིས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་གྱིས་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: “Mother, Father, I ask for your kind permission to travel to Magadha and practice the holy life in the presence of the Blessed One.”

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱི་བསམས་པ།
en: His parents thought,

source: འདི་ནི་བདག་ཅག་གིས་བཟློག་པར་མི་ནུས་སོ་
en: “We will not be able to stop him,”

source: སྙམ་དུ་རིག་ནས་སྨྲས་པ།
en: and knowing this to be the case, they said,

source: སྡོད་ཅིག་དང་བདག་ཅག་གཉིས་ཀྱིས་ཁྱིམ་གྱི་འཁོར་བཏང་ནས་དེའི་འོག་ཏུ་ལྷན་ཅིག་ཏུ་འདོང་ལ་བཅོམ་ལྡན་འདས་དེའི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བྱའོ་
en: “Join us. We both want to give up our householder duties and go with you to practice the holy life in the presence of the Blessed One.”

source: ཞེས་དེ་སྐད་སྨྲས་ནསདེ་གཉིས་ཀྱིས་ཁྱིམ་གྱི་འཁོར་བཏང་སྟེ་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས་ཡུལ་དབུས་སུ་དོང་སྟེ།
en: Having said this, they gave up their householder duties, gave gifts, made merit, and set out for Magadha.

source: དེ་དག་མཐར་གྱིས་དོང་དོང་བ་ལས་རྒྱལ་པོའི་ཁབ་ཏུ་ཕྱིན་ནས་དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་བ་དང་། ཁྱེའུ་དེ་དང་དེའི་ཕ་མ་གཉིས་ཀྱིས་ཐག་རིང་པོ་ཞིག་ནས།
en: When they finally arrived in Rājagṛha and went to see the Blessed One, the young man and his parents saw him from a distance.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ། བླ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས། དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ནི་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: The sight of the Blessed One filled them with supreme joy, for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་སོ། །དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: Seeing the Blessed Buddha in this way, they were filled with supreme joy, and they approached the Blessed One, touched their heads to his feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། དེ་རྣམས་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their thoughts, habitual tendencies, temperaments, and natures, and taught them the Dharma accordingly.

source: དེ་རྣམས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Hearing it, they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Having seen the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and made this request:

source: བཙུན་པ་བདག་ཅག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: བདག་ཅག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ། །
en: In the presence of the Blessed One, we too wish to practice the holy life.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གཉིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་དོ། །
en: The Blessed One led the father and son to go forth by saying “Come, monks!” and, conferring on them full ordination, instructed them.

source: དེ་གཉིས་ལ་ལུང་ཡང་ཕོག་སྟེ། དེ་གཉིས་ཀྱིས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: རིག་པས་སྒོ་ངའི་སྦུབས་བཅོམ་པ་རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: Their insight crushed ignorance like an eggshell. They achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ། དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: They had no regard for worldly profit, passion, or acclaim. They became objects of offering, veneration, and respectful address by Indra, Upendra, and the other gods.
